_Rarzrabotki/Rarus/USO2/Documents/СМ_ОбъектнаяСмета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>СМ_ОбъектнаяСмета</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазисныеЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлаваССРС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ГлавыССРС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_ОбъектнаяСмета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДРодителя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_СводнаяСмета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инвестор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодикаРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_МетодикиРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСметы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подрядчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроводитьОкругление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоставленаВЦенахНа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_СтатусыСметныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стройка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСтроительства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМ_ТипыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматОкругления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЛокальныеСметы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛокальнаяСмета</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СМ_ЛокальнаяСмета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоОбъектов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расчет</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЛимитированныеЗатраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛимитированнаяЗатрата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СМ_ЛимитированныеЗатраты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеЛимЗатраты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормулаЛимЗатраты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазисноеЗначениеЛимЗатраты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФормулаБазисногоЗначениеЛимЗатраты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентСметнойЗарплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентТрудоемкости</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расчет</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подписи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыводитьВШапку</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/СМ_ОбъектнаяСмета/Ext/ManagerModule.bsl
#Область РасчетСметы

Процедура ВыполнитьРасчетТекущейОбъектнойСметы(Ссылка)
	
	Если Не Ссылка.ПометкаУдаления Тогда  // ранее было Ссылка.Проведен.. sudav
		СМ_СметаРасчетВызовСервера.РассчитатьЛимитированныеЗатраты(Ссылка);
	Иначе
		СМ_СметаВызовСервера.УдалитьДвижения(Ссылка);
	КонецЕсли;
	
КонецПроцедуры

// Основная процедура расчета объектной сметы, выполняет пересчет сметы.
//
// Параметры:
//   Объект - ДокументОбъект.СМ_ОбъектнаяСмета или ДокументСсылка.СМ_ОбъектнаяСмета.
//   СметыУжеРассчитаны - Истина - подчиненные сметы уже рассчитаны и их пересчет не требуется, 
//  					  Ложь - требуется пересчет подчиненных смет.
Процедура Перерасчет(Объект, СметыУжеРассчитаны = Ложь) Экспорт
	
	ВыполнитьРасчетТекущейОбъектнойСметы(Объект);
		
КонецПроцедуры

Процедура ПерерасчетПодчиненныхСмет(Объект) Экспорт
	
	Для Каждого СтрСмет Из Объект.ЛокальныеСметы Цикл
		Если СтрСмет.ЛокальнаяСмета.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		Документы.СМ_ЛокальнаяСмета.Перерасчет(СтрСмет.ЛокальнаяСмета,,Ложь);
	КонецЦикла;
		
КонецПроцедуры

Процедура ПерерасчетВключаяПодчиненныеСметы(Объект) Экспорт
	
	Для Каждого СтрСмет Из Объект.ЛокальныеСметы Цикл
		Если СтрСмет.ЛокальнаяСмета.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		Документы.СМ_ЛокальнаяСмета.Перерасчет(СтрСмет.ЛокальнаяСмета,,Ложь);
	КонецЦикла;
	Перерасчет(Объект,Истина);	
КонецПроцедуры

#КонецОбласти

#Область Печать

// Процедура для БСП Печать, добавляет список печатных форм.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - таблица в которую добавляются строки, 
//									   описывающие команды печати документа СМ_ОбъектнаяСмета.
//									   Подробнее в подсистеме "Печать".
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт   
		
	// Основная форма
	КомандаПечати 									= КомандыПечати.Добавить();
	КомандаПечати.менеджерПечати 					= "Документ.СМ_ОбъектнаяСмета";
	КомандаПечати.Идентификатор 					= "ПФ_MXL_МакетОС";
	КомандаПечати.Представление 					= НСтр("ru = 'Объектная смета'");
	КомандаПечати.ЗаголовокФормы					= НСтр("ru = 'Печать объектной сметы'");
	КомандаПечати.ПроверкаПроведенияПередПечатью 	= Истина;
	
	КомандаПечати 									= КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати 					= "Документ.СМ_ОбъектнаяСмета";
	КомандаПечати.Идентификатор 					= "ПФ_MXL_СМ_КЗ_МакетОС";
	КомандаПечати.Представление 					= НСтр("ru = 'Объектная смета (Казахстан)'");
	КомандаПечати.ЗаголовокФормы					= НСтр("ru = 'Печать объектной сметы (Казахстан)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью 	= Истина;
	КомандаПечати.ФункциональныеОпции				= "СМ_КЗ_МетодикаРСНБКазахстан";
	
	// форма4
	КомандаПечати 									= КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати 					= "Документ.СМ_ОбъектнаяСмета";
	КомандаПечати.Идентификатор	 					= "ПФ_MXL_Макет_Форма4";
	КомандаПечати.Представление 					= НСтр("ru = 'Форма №4'");
	КомандаПечати.ЗаголовокФормы					= НСтр("ru = 'Печать форма №4'");
	КомандаПечати.ПроверкаПроведенияПередПечатью 	= Истина;

КонецПроцедуры

// Формирует печатные формы.
// ПАРАМЕТРЫ:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                          представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода - Структура - дополнительные параметры сформированных табличных документов (выходной параметр).
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	СМ_СметаПечатьВызовСервера.ПечатьОбъектнойСметы(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
		
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ПредставлениеОбъекта

// ДокторСофт
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
     СтандартнаяОбработка = Ложь;
     Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Объектная смета №%1 %2'"), Строка(Данные.НомерСметы) ,Строка(Данные.Наименование));
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	 
     СтандартнаяОбработка = Ложь;

     Поля.Добавить("НомерСметы");
	 Поля.Добавить("Наименование");
	 
КонецПроцедуры
// ДокторСофт

#КонецОбласти
